{
  "version": 0.1,
  "locale": "es",
  "entries": {
    "437320feab17": "LangOS",
    "6c6b28299fe4": "Entorno de pruebas de localización con el compilador de Lingo.dev y demostración de traducción en tiempo de ejecución.",
    "7284a40942b1": "Idioma",
    "9edcb13408db": "Idioma",
    "734cdc15fbf0": "Cambiar tema",
    "e0c0151d293e": "LangOS",
    "d6ddf6948904": "|",
    "67922c3115e5": "Resumen",
    "1e16ee64bdf0": "Área de pruebas",
    "0c45a6dafdd4": "Flujo de trabajo",
    "380700438010": "Área de pruebas",
    "1ba184945a35": "Área de pruebas de localización",
    "bdfaaf4c87e4": "Configuración regional actual:",
    "b51236f80cfe": "Interfaz estática",
    "258e66e9a3e1": "Estas cadenas se compilan para localización en tiempo de compilación a través de Lingo Compiler.",
    "b1fdd64b6096": "Panel de localización",
    "77516117dffc": "Realiza un seguimiento de la cobertura de configuración regional en las superficies del producto.",
    "4428a3897764": "Cola de traducción",
    "69188da02d56": "Pone en cola las actualizaciones de cadenas antes del lanzamiento.",
    "2b27830d1d8d": "Lista de verificación de control de calidad",
    "681cefb8c1fd": "Revisa el formato y el diseño en cada configuración regional.",
    "84543e7ae6dc": "Traducción en tiempo de ejecución",
    "8caf11d83fc7": "Esto llama a <code0></code0>, impulsado por el SDK de Lingo, para texto de usuario dinámico.",
    "dbc5e7ec6cf3": "Desde configuración regional",
    "e826677cdf78": "Hacia configuración regional",
    "5fbcabb52bd3": "Introduce el texto a traducir",
    "7ee1b5b379d5": "Traduciendo {expression0} a {expression1}",
    "d98d644ac546": "Resultado traducido",
    "dd21aed019be": "Formato",
    "99481fc827b1": "Los valores a continuación se generan con <code0></code0> y <code1></code1>.",
    "71d2cccfbf7e": "Moneda",
    "679156bea866": "Fecha",
    "c4f170cfca4c": "Dirección del diseño",
    "a7dfe3e4a37e": "Configuración regional",
    "bf8303cced81": "establece la dirección del documento en",
    "7ab04efd4287": ".",
    "000aff352547": "Flujo de trabajo",
    "17620f7cdbc5": "Lingo Compiler extrae cadenas de interfaz durante la compilación y conecta el renderizado consciente de la configuración regional para que el contenido estático pueda enviarse con paquetes traducidos.",
    "1aaaee7ac6d9": "Flujo de trabajo CLI",
    "24b585bbf0b4": "Infraestructura de localización para productos reales",
    "2ab6925a7a0e": "Ver flujo de trabajo",
    "2b56d4fd700b": "El comando CLI npx lingo.dev run escanea archivos fuente, actualiza artefactos de configuración regional y mantiene los recursos de idioma sincronizados con los cambios de código.",
    "2c5bf7977cfd": "Ejecuta el CLI de Lingo localmente cada vez que cambie el texto de la interfaz.",
    "2da59600dbce": "Los despliegues envían paquetes estáticos localizados desde el compilador. En tiempo de ejecución, el cambio de configuración regional utiliza la configuración regional del usuario persistida, y la traducción de texto dinámico continúa a través de la ruta API respaldada por SDK.",
    "329c152c771a": "CLI",
    "4054ed3a4a11": "La infraestructura de localización es el conjunto de sistemas de compilación, tiempo de ejecución y despliegue que mantienen el contenido del producto, el formato y el diseño correctos en todos los idiomas.",
    "40da4e144308": "Localización en tiempo de compilación (Lingo Compiler)",
    "40fc9745310d": "Durante la compilación, Lingo Compiler escanea archivos fuente, extrae cadenas estáticas y conecta la salida específica de la configuración regional para que el contenido estático de la interfaz se traduzca en el paquete desplegado.",
    "44383ea62ad4": "Flujo de trabajo del desarrollador para localización",
    "60c9043b6c07": "El texto dinámico se traduce en tiempo de ejecución a través de la ruta Lingo MCP o SDK, que es ideal para contenido generado por usuarios y flujos de trabajo en vivo.",
    "61bfe175157a": "Mantén la localización determinista combinando extracción del compilador, verificaciones de traducción en tiempo de ejecución y aplicación de CI.",
    "80310b973813": "Comportamiento del despliegue",
    "a5a34035e2e1": "RTL y formato",
    "adb1e7f12300": "Abrir playground",
    "b231612fc10a": "Agrega verificaciones de localización a CI para que las pull requests fallen temprano cuando las cadenas o artefactos de configuración regional se desvíen.",
    "b32cdceef412": "CI ejecuta verificaciones de localización y generación de traducciones antes del despliegue para que cada lanzamiento tenga cobertura de configuración regional verificada.",
    "bf6dded23843": "El formato consciente de la configuración regional y el cambio RTL son de primera clase. El árabe invierte la dirección del documento, mientras que las APIs Intl localizan números, moneda y fechas.",
    "cfcb315ad31c": "Integración CI",
    "e7e7ddc90895": "Traducción en tiempo de ejecución (Lingo MCP / SDK)",
    "f374646c9856": "Integración CI",
    "f472fcdf402f": "Extracción en tiempo de compilación",
    "fccffd2af69f": "Descripción general",
    "0dcef36791b7": "Mostrar automatización CLI + CI en el flujo de trabajo para que las nuevas cadenas siempre se procesen.",
    "11a5e548a4dd": "El texto en tiempo de ejecución necesita traducción de/a la configuración regional.",
    "2b25af14a046": "Puerta de cobertura de traducción",
    "3457b2949ea8": "Ir a interfaz estática",
    "39062509ad59": "1. Cadenas codificadas",
    "3ecb3fedee89": "Ir a flujo de trabajo CLI",
    "41411f3488f2": "Usa estos seis puntos como tu narrativa. Cada elemento se corresponde con una sección activa en este playground o página de flujo de trabajo.",
    "5a26dc0ec3f1": "Ir a formato",
    "6563f50b8a49": "4. Ignorar el formato",
    "70554457f906": "CI debería bloquear los despliegues cuando la salida de localización esté desactualizada. Trata las traducciones faltantes como un fallo de compilación, no como una sorpresa en tiempo de ejecución.",
    "70b7a69c14f8": "El texto de la interfaz debe extraerse, no dispersarse en línea.",
    "8a4d729e9229": "La copia manual de archivos falla a escala.",
    "8a650d2269e3": "6. Sin puerta de cobertura",
    "918bd7926bb5": "Ir a cobertura CI",
    "9d368f418299": "Ir a dirección de diseño",
    "a3264631caba": "Las traducciones faltantes deberían fallar en CI antes del despliegue.",
    "a906b7638689": "Usa la sección de tiempo de ejecución con selectores de configuración regional de origen y destino.",
    "ac83f1c73c0e": "Mostrar la sección de localización en tiempo de compilación donde las cadenas son gestionadas por el compilador.",
    "b0b7378e9bf3": "5. Falta traducción dinámica",
    "b0d59ff95a6f": "El formato de configuración regional es parte de la localización.",
    "bfa4c0d87646": "Ir a traducción en tiempo de ejecución",
    "c6a94329a806": "Cambia a árabe y muestra cómo la dirección HTML cambia a RTL.",
    "d35c5d73bba7": "3. Ignorar RTL",
    "d6aa247428eb": "Mostrar la sección de cobertura del flujo de trabajo donde CI aplica las comprobaciones de localización.",
    "d8a72ecd0b61": "Cómo explicar esta demo",
    "e3b885f4ecd9": "La traducción sin soporte de dirección está incompleta.",
    "e5b741dbb0db": "Demostrar cómo la salida de moneda y fecha cambia con la configuración regional.",
    "e719dd5efb5d": "2. Deriva de traducción manual",
    "e880dcb2d018": "Si la CLI no está autenticada, ejecuta <code0></code0> primero.",
    "2b79c08aeaab": "4. La sección de formato muestra la salida de moneda y fecha adaptada a la configuración regional.",
    "37f5d452f8e0": "3. La sección de tiempo de ejecución traduce el texto del usuario con configuraciones regionales de origen y destino.",
    "46c6b7b0aeb2": "1. Cambia el idioma de la barra de navegación y muestra el cambio de configuración regional de página completa.",
    "881c6e37ad42": "6. La página de flujo de trabajo muestra la puerta de cobertura CLI + CI antes del despliegue.",
    "a613353e0cdd": "Demostración en vivo",
    "ac009679e312": "Muestra esto en orden: cambio de configuración regional, compilación estática, traducción en tiempo de ejecución, formato, dirección RTL y luego cobertura de CI.",
    "be30a9462893": "5. La sección de dirección de diseño demuestra el cambio RTL para árabe.",
    "d7c740bd42a6": "2. La sección de interfaz estática demuestra las cadenas extraídas en tiempo de compilación.",
    "038e40f75d70": "Lingo Compiler extrae cadenas de interfaz estáticas durante la compilación y sirve salida específica del idioma cuando cambias el idioma.",
    "0cef85b2bbe7": "CLI",
    "13afee90119f": "Localización en tiempo de compilación (Lingo Compiler)",
    "1f556bc7feb7": "La traducción en tiempo de ejecución maneja texto dinámico a través de la ruta <code0></code0> respaldada por SDK.",
    "21aa5a43f4ec": "Actualizar plan",
    "3c839a582534": "Salida traducida",
    "3cf0fa100168": "Traducción en tiempo de ejecución (Lingo MCP / SDK)",
    "3f14af3310f4": "Ver facturas",
    "5b1ebd23138e": "Flujo de trabajo del desarrollador",
    "5e5a41b345d7": "Precio",
    "6b0f422ffeea": "Fecha",
    "7434952bb61c": "Bienvenido de nuevo, Ashish",
    "77a21e0b0a3f": "Idioma activo: <strong0>{expression0}</strong0>. Dirección: <strong1>{documentDirection}</strong1>.",
    "81994147d76f": "El formato de moneda y fecha reacciona al idioma actual mediante <code0></code0> y <code1></code1>.",
    "99d02aff45ac": "Entorno de pruebas de localización",
    "a942608fc41e": "Entorno de pruebas de localización de una sola página con demostraciones de i18n en tiempo de compilación y ejecución.",
    "be7926a3fd1e": "Entorno de pruebas de localización",
    "ca00bb284010": "LangOS",
    "d63e3827d119": "Soporte RTL",
    "d70ab9076bf2": "Escribe texto dinámico para traducir",
    "d90edd531376": "Cuando el idioma es árabe, la dirección del documento cambia a <code0></code0> y el diseño sigue el flujo de derecha a izquierda.",
    "d933e3d2795f": "Formato según idioma",
    "e4226cb35073": "Interfaz localizada estática",
    "e62b09fca9f1": "Cambia el idioma en el encabezado para verificar que esta sección se actualiza instantáneamente.",
    "e7f6a394e162": "La automatización mantiene la localización actualizada: ejecuta CLI en desarrollo y aplica cobertura de traducción en CI antes del despliegue.",
    "e82537f2972b": "Idioma de destino: {expression0}",
    "f0f841d21fc2": "Un entorno de pruebas de una sola página para localización en tiempo de compilación, traducción en tiempo de ejecución, comportamiento RTL, formato según idioma y automatización del flujo de trabajo del desarrollador.",
    "f6896171ea43": "YAML de CI",
    "cda1acfee5bb": "El panel de destino puede cambiar de dirección sin mover el texto de origen.",
    "861582cad2f7": "Pagar",
    "8ca69074eb0c": "Dirección",
    "70821947cf7e": "Pago",
    "ba54b8be65b1": "Configuración regional",
    "87cecdd828ce": "Moneda",
    "0368d3ae1aba": "Número",
    "22fed6e6a78d": "Fecha",
    "cbc3a596df28": "Panel de lanzamiento",
    "dc315567f86f": "Bienvenido de nuevo, {trimmedName}.",
    "fc3cb23fde0b": "Las comprobaciones de localización pasaron para esta rama.",
    "ba4bdf3ff019": "Publicar lanzamiento",
    "9d95fafac17b": "Ver idiomas"
  }
}